koraei/mcxn947Test/firmware/app/src/led_task.c
#include "led_task.h"
#include "app_config.h"

#include "board.h"
#include "fsl_debug_console.h"

#include "FreeRTOS.h"
#include "task.h"

#ifndef APP_LED_COLOR_GREEN
#define APP_LED_COLOR_GREEN 1
#endif
#ifndef APP_LED_COLOR_BLUE
#define APP_LED_COLOR_BLUE 2
#endif

#if !defined(APP_LED_COLOR_ID)
#if defined(APP_VARIANT_IS_V2)
#define APP_LED_COLOR_ID APP_LED_COLOR_BLUE
#else
#define APP_LED_COLOR_ID APP_LED_COLOR_GREEN
#endif
#endif

static void led_task(void *arg)
{
    (void)arg;

    /* First action: clear bootloader LED (red). */
    LED_RED_INIT(LOGIC_LED_OFF);
    LED_RED_OFF();
    LED_GREEN_INIT(LOGIC_LED_OFF);
    LED_BLUE_INIT(LOGIC_LED_OFF);
    LED_GREEN_OFF();
    LED_BLUE_OFF();

    PRINTF("LED task start variant=%s on=%u off=%u\r\n", APP_VARIANT, (unsigned)APP_LED_ON_MS,
           (unsigned)APP_LED_OFF_MS);

    for (;;)
    {
#if (APP_LED_COLOR_ID == APP_LED_COLOR_BLUE)
        LED_BLUE_ON();
#else
        LED_GREEN_ON();
#endif
        vTaskDelay(pdMS_TO_TICKS(APP_LED_ON_MS));
#if (APP_LED_COLOR_ID == APP_LED_COLOR_BLUE)
        LED_BLUE_OFF();
#else
        LED_GREEN_OFF();
#endif
        vTaskDelay(pdMS_TO_TICKS(APP_LED_OFF_MS));
    }
}

void led_task_start(void)
{
    if (xTaskCreate(led_task, "led", 512, NULL, tskIDLE_PRIORITY + 1, NULL) != pdPASS)
    {
        PRINTF("LED task create failed\r\n");
    }
}
